cf-src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРезерв</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf-src/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf-src/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf-src/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПодтверждению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf-src/Documents/ЗаказКлиента/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыЗаказов.Черновик;
	КонецЕсли;
	
	ПроверитьЗаполнениеШапки(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если Товары.Количество() = 0 Тогда
		Сообщить("Заказ клиента не может быть записан без строк в табличной части 'Товары'.", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммыИРезервы();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ЕстьДефицитДляРезерва() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.РезервыТоваров.Записывать = Истина;
	
	ЕстьНерезервируемыеСтроки = Ложь;
	ЕстьРезерв = Ложь;
	
	Для каждого СтрокаТовара Из Товары Цикл
		
		КоличествоРезерва = ?(ЗначениеЗаполнено(СтрокаТовара.КоличествоРезерв), СтрокаТовара.КоличествоРезерв, 0);
		
		Если КоличествоРезерва <= 0 Тогда
			ЕстьНерезервируемыеСтроки = Истина;
			Продолжить;
		КонецЕсли;
		
		ЕстьРезерв = Истина;
		
		Движение = Движения.РезервыТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = СтрокаТовара.Номенклатура;
		Движение.Склад = Склад;
		Движение.ЗаказКлиента = Ссылка;
		Движение.Количество = КоличествоРезерва;
	
	КонецЦикла;
	
	Если ЕстьРезерв И НЕ ЕстьНерезервируемыеСтроки Тогда
		Статус = Перечисления.СтатусыЗаказов.ВРезерве;
	Иначе
		Статус = Перечисления.СтатусыЗаказов.Подтвержден;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеШапки(Отказ)

	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Сообщить("Не заполнен реквизит 'Клиент'.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не заполнен реквизит 'Склад'.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		Сообщить("Не заполнен реквизит 'Вид цен'.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьСуммыИРезервы()

	СуммаДокумента = 0;

	Для каждого СтрокаТовара Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Количество) Тогда
			СтрокаТовара.Количество = 0;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Цена) Тогда
			СтрокаТовара.Цена = 0;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.КоличествоРезерв) Тогда
			СтрокаТовара.КоличествоРезерв = СтрокаТовара.Количество;
		КонецЕсли;
		
		Если СтрокаТовара.КоличествоРезерв > СтрокаТовара.Количество Тогда
			СтрокаТовара.КоличествоРезерв = СтрокаТовара.Количество;
		КонецЕсли;
		
		СтрокаТовара.Сумма = Окр(СтрокаТовара.Количество * СтрокаТовара.Цена, 2);
		СуммаДокумента = СуммаДокумента + СтрокаТовара.Сумма;
	
	КонецЦикла;

	СуммаДокумента = Окр(СуммаДокумента, 2);

КонецПроцедуры

Функция ЕстьДефицитДляРезерва()

	ТаблицаТоваров = Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.КоличествоРезерв) КАК КоличествоРезерв
	|ПОМЕСТИТЬ ВТРезервДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК Товары
	|ГДЕ
	|	Товары.КоличествоРезерв > 0
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ВТРезервДокумента.Номенклатура КАК Номенклатура,
	|	ВТРезервДокумента.КоличествоРезерв КАК КоличествоРезерв,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК КоличествоУжеВРезерве
	|ИЗ
	|	ВТРезервДокумента КАК ВТРезервДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&Момент,
	|			Склад = &Склад
	|				И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТРезервДокумента)) КАК Остатки
	|		ПО ВТРезервДокумента.Номенклатура = Остатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваров.Остатки(&Момент,
	|			Склад = &Склад
	|				И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТРезервДокумента)
	|				И ЗаказКлиента <> &ТекущийЗаказ) КАК Резервы
	|		ПО ВТРезервДокумента.Номенклатура = Резервы.Номенклатура
	|ГДЕ
	|	ВТРезервДокумента.КоличествоРезерв > (ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Резервы.КоличествоОстаток, 0))";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Момент", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТекущийЗаказ", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Сообщить("Невозможно провести заказ: недостаточно доступного количества для резерва.", СтатусСообщения.Важное);
	
	Пока Истина Цикл
		Доступно = Выборка.КоличествоОстаток - Выборка.КоличествоУжеВРезерве;
		Дефицит = Выборка.КоличествоРезерв - Доступно;
		Сообщить(
			СтрШаблон("Номенклатура '%1': к резерву %2, доступно %3, дефицит %4.",
				Выборка.Номенклатура,
				Формат(Выборка.КоличествоРезерв, "ЧГ=15.3"),
				Формат(Доступно, "ЧГ=15.3"),
				Формат(Дефицит, "ЧГ=15.3")),
			СтатусСообщения.Важное);
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции
